if умова1:
    # Код виконується, якщо умова1 істинна
    if умова2:
        # Цей код виконується, якщо умова1 і умова2 істинні
    else:
        # Цей код виконується, якщо умова1 істинна, але умова2 хибна
else:
    # Цей код виконується, якщо умова1 хибна

x = 10
y = 5

if x > 0:  # Перевіряємо, чи x позитивний
    if y > 0:  # Якщо так, перевіряємо, чи y теж позитивний
        print("x і y позитивні")
    else:
        print("x позитивний, але y не позитивний")
else:
    print("x не позитивний")
