                                 # Функция Range
# Функция range в сочетании с циклом for Python является мощным инструментом для контроля повторения действий определенное количество раз. Этот механизм часто используется для итерации из-за последовательности чисел, что делает его особенно полезным для различных задач, от базовых до сложных алгоритмов.
# Функция range создает последовательность чисел. Она может быть использована разными способами:

# range(stop): Создает последовательность чисел от 0 до stop – 1.
# range(start, stop): Генерирует числа от start к stop – 1.
# range(start, stop, step): Создает числа от start к stop – 1, с шагом step.

for i in range(5):
    print(i)
# У цьому прикладі range(5) генерує послідовність чисел від 0 до 4. Цикл for проходиться по цій послідовності, і змінна i приймає значення кожного числа в послідовності по черзі. Це був приклад простої ітерації.
# Ітерація з визначеним початком і кінцем ітерації. Приклад виведення чисел від 2 до 9.

for i in range(2, 10):
    print(i)
# Ітерація з кроком. Цей приклад виведе парні числа від 0 до 8.

for i in range(0, 10, 2):
    print(i)
# Функція range разом з циклом for є основою для структурованого повторення коду та важливою частиною багатьох алгоритмів і програм у Python. 
# Вони дають можливість легко маніпулювати послідовностями чисел для вирішення різноманітних задач.