'''Спеціальні символи

Спеціальні символи в рядках у Python, відомі також як екрановані символи або escape-символи, використовуються для представлення певних керувальних послідовностей або для включення символів, які не можна ввести безпосередньо у рядок коду.
Ці символи починаються з оберненої косої риски (backslash, \), після якої йде один або кілька символів, що визначають спеціальну послідовність. Це означає, що наступний за ним знак потрібно сприймати як спеціальний символ, а не буквально.
\n відповідає за перенос рядка (line break).
\f відповідає за перенос сторінки (form feed).
\t відповідає за перенос табуляції (tab).
\r відповідає за перенос каретки (carriage return).
\' відповідає за одинарну лапку (single quote).
\" відповідає за дві лапки (double quote).

Ось основні керувальні символи які необхідно знати:

Наприклад, символ \n відповідає за перенос рядка (line break).'''