'''
1. Для чого використовуються функції у Python?
Для групування та повторного виклику коду
2. Як створюється та викликається функція у Python?
Використовуючи ключове слово def та дужки ()
3. Що таке параметри у функції Python?
Перемінні, які використовуються всередині функції
4. Що таке типізація ("type hints") у Python?
Підказки для типізації параметрів функції
5. Що таке LEGB у Python?
Правило областей видимості змінних
6. Що таке ключові аргументи у Python?
Аргументи, що вказуються за їх ім'ям
7. Як працює змінна кількість параметрів у Python?
Дозволяє функції приймати будь-яку кількість аргументів
8. Що таке рекурсія у Python?
Виклик функції самою собою в рамках її виконання










'''