'''
1. Для чого призначений модуль datetime у Python?
Для роботи з даними дати та часу

2. Що робить метод strftime у Python?
Форматує об'єкт дати у зрозумілий рядок

3. Який результат видає datetime.now() у Python?
Поточну дату та час як об'єкт datetime

4. Як створити об'єкт datetime з поточною датою та часом у Python?
datetime.now()

5. Як у Python за допомогою модуля time дізнатися поточний час у секундах з початку епохи?
time.time()

6. Яка функція модуля math використовується для обчислення квадратного кореня числа у Python?
math.sqrt()

7. Як в Python генерувати випадкові числа в діапазоні від a до b включно з використанням модуля random?
random.randint(a, b)

8. Яка функція у модулі datetime використовується для порівняння двох дат?
Не потрібна спеціальна функція

9. Який метод в модулі datetime можна використати для додавання або віднімання часового інтервалу до/від дати?
datetime.timedelta()

10. Яка функція у модулі math використовується для обчислення натурального логарифму числа?
math.log()'''