'''
1. Яка команда в Python створює новий текстовий файл?
open('file.txt', 'w')

2. Що робить метод write() у Python?
Записує рядок у файл

3. Як у Python відкрити файл в режимі тільки для читання?
open('file.txt', 'r')

4. Що означає використання режиму 'a' при відкритті файлу у Python?
Додавання вмісту в кінець файлу

5. Який режим відкриття файлу в Python дозволяє читати та додавати новий контент файл без його видалення, якщо він існує?
'r+'

6. Який модуль у Python забезпечує високорівневі функції для роботи з файловою системою?
shutil

7. Яка функція в модулі pathlib в Python використовується для отримання повного шляху до файлу?
Path.absolute()

8. Для чого використовується метод seek() у Python?
Для переміщення курсору на певну позицію у файлі

9. Яка функція використовується в Python для перевірки існування певного шляху або файлу?
pathlib.Path.exists()

10. Який метод використовується у Python для читання всього вмісту файлу як одного рядка?
read()

'''
